{
  "cso": {
    "company": "Cambridge City Website Design",
    "position": "Full-Stack Web Developer",
    "period": "March 2025 - Present",
    "achievements": [
      {
        "title": "CSO Reporting Platform Development",
        "description": "Led development team to build comprehensive website for Cambridge City tracking Combined Sewer Overflow problems with modern UI/UX and robust backend infrastructure."
      },
      {
        "title": "Multilingual & Document Management Implementation",
        "description": "Implemented full multilingual support and built sophisticated document management system for organizing CSO reports and regulatory compliance materials."
      },
      {
        "title": "Performance & Architecture Optimization",
        "description": "Architected scalable solution using cutting-edge frameworks with advanced caching and responsive design, achieving 40% faster load times."
      }
    ],
    "reports": []
  },
  "hitachi": {
    "company": "Hitachi Digital Service Vietnam",
    "position": "Backend Developer | Intern",
    "period": "May 2025 - August 2025",
    "achievements": [
      {
        "title": " Backend Development",
        "description": "Developed 30+ backend features for an IoT platform using FastAPI and PostgreSQL, including telemetry ingestion, role-based access control (RBAC), real-time WebSocket updates, and predictive air quality modeling via C++ integration."
      },
      {
        "title": "Building Analytics & Performance Optimization",
        "description": "Created advanced building dashboards with rolling averages, CO₂ anomaly detection, and busiest-hour metrics, optimizing database performance using JSONB indexes, GIN indexing, and CTEs."
      },
      {
        "title": "Distributed Configuration Management",
        "description": "Implemented atomic multi-system configuration updates using the Saga pattern with audit logging and rollback to ensure data integrity across services."
      },
      {
        "title": "DevOps Automation Pipeline",
        "description": "Built an automated workflow to extract Redmine issue data, transform to Parquet/CSV formats, and upload to Azure Storage or shared folders with robust error handling and retry logic."
      }
    ],
    "reports": [
      {
        "link": "https://drive.google.com/file/d/YOUR_PDF_ID_HERE/view?usp=sharing"
      }
    ]
  },
  "wpi": {
    "company": "Worcester Polytechnic Institute",
    "position": "Research Assistant & Software Developer",
    "period": "May 2024 - August 2024",
    "achievements": [
      {
        "title": "Academic Portal Development",
        "description": "Collaborated with professor to develop comprehensive web portal enabling course registration and SA/TA applications using modern web technologies."
      },
      {
        "title": "Database Architecture & API Design",
        "description": "Designed robust database schemas for course management and application workflows. Developed RESTful APIs for seamless frontend-backend integration."
      },
      {
        "title": "Application Management Automation",
        "description": "Created automated application review system for SA/TA positions with tracking, notifications, and administrative workflows, reducing processing time by 60%."
      }
    ],
    "reports": []
  }
}
